from UCHIHA import app 
import asyncio
import random
from pyrogram import Client, filters
from pyrogram.enums import ChatType, ChatMemberStatus
from pyrogram.errors import UserNotParticipant
from pyrogram.types import ChatPermissions

spam_chats = []

EMOJI = [ "🦋🦋🦋🦋🦋",
          "🧚🌸🧋🍬🫖",
          "🥀🌷🌹🌺💐",
          "🌸🌿💮🌱🌵",
          "❤️💚💙💜🖤",
          "💓💕💞💗💖",
          "🌸💐🌺🌹🦋",
          "🍔🦪🍛🍲🥗",
          "🍎🍓🍒🍑🌶️",
          "🧋🥤🧋🥛🍷",
          "🍬🍭🧁🎂🍡",
          "🍨🧉🍺☕🍻",
          "🥪🥧🍦🍥🍚",
          "🫖☕🍹🍷🥛",
          "☕🧃🍩🍦🍙",
          "🍁🌾💮🍂🌿",
          "🌨️🌥️⛈️🌩️🌧️",
          "🌷🏵️🌸🌺💐",
          "💮🌼🌻🍀🍁",
          "🧟🦸🦹🧙👸",
          "🧅🍠🥕🌽🥦",
          "🐷🐹🐭🐨🐻‍❄️",
          "🦋🐇🐀🐈🐈‍⬛",
          "🌼🌳🌲🌴🌵",
          "🥩🍋🍐🍈🍇",
          "🍴🍽️🔪🍶🥃",
          "🕌🏰🏩⛩️🏩",
          "🎉🎊🎈🎂🎀",
          "🪴🌵🌴🌳🌲",
          "🎄🎋🎍🎑🎎",
          "🦅🦜🕊️🦤🦢",
          "🦤🦩🦚🦃🦆",
          "🐬🦭🦈🐋🐳",
          "🐔🐟🐠🐡🦐",
          "🦩🦀🦑🐙🦪",
          "🐦🦂🕷️🕸️🐚",
          "🥪🍰🥧🍨🍨",
          " 🥬🍉🧁🧇",
        ]

TAGMES = [
    " **हज़ारों ख़्वाहिशें ऐसी कि हर ख़्वाहिश पे दम निकले — बहुत निकले मेरे अरमान लेकिन फिर भी कम निकले।** ",
    " **दिल ही तो है न संग-ओ-ख़िश्त, दर्द से भर न आए क्यों।** ",
    " **इश्क़ ने ‘ग़ालिब’ निकम्मा कर दिया, वरना हम भी आदमी थे काम के।** ",
    " **हमको मालूम है जन्नत की हक़ीक़त लेकिन, दिल के बहलाने को ‘ग़ालिब’ ये ख़याल अच्छा है।** ",
    " **रगों में दौड़ते फिरने के हम नहीं क़ायल, जब आँख ही से न टपका तो फिर लहू क्या है।** ",
    " **क़ैद-ए-हयात-ओ-बंद-ए-ग़म अस्ल में दोनों एक हैं।** ",
    " **इश्क़ पर ज़ोर नहीं है ये वो आतिश ‘ग़ालिब’, कि लगाए न लगे और बुझाए न बने।** ",
    " **बस कि दुश्वार है हर काम का आसाँ होना, आदमी को भी मयस्सर नहीं इंसाँ होना।** ",
    " **कोई उम्मीद बर नहीं आती, कोई सूरत नज़र नहीं आती।** ",
    " **दिल-ए-नादाँ तुझे हुआ क्या है, आख़िर इस दर्द की दवा क्या है।** ",
    " **हुई मुद्दत कि ‘ग़ालिब’ मर गया, पर याद आता है हर एक बात पे।** ",
    " **आह को चाहिए इक उम्र असर होते तक, कौन जीता है तेरी ज़ुल्फ़ के सर होते तक।** ",
    " **न था कुछ तो ख़ुदा था, कुछ न होता तो ख़ुदा होता।** ",
    " **दिल से तेरी निगाह जिगर तक उतर गई।** ",
    " **इश्क़ ने ग़ालिब निकम्मा कर दिया।** ",
    " **हम हैं मुश्ताक़ और वो बेज़ार, या इलाही ये माजरा क्या है।** ",
    " **इब्तिदा-ए-इश्क़ है रोता है क्या, आगे-आगे देखिए होता है क्या।** ",
    " **दिल-ए-नादाँ तुझे हुआ क्या है।** ",
    " **क़र्ज़ की पीते थे मैं और समझते थे कि हाँ, रंग लाएगी हमारी फ़ाक़ामस्ती एक दिन।** ",
    " **ज़िंदगी अपनी जब इस शक्ल से गुज़री ‘ग़ालिब’, हम भी क्या याद करेंगे कि ख़ुदा रखते थे।** ",
    " **हर एक बात पे कहते हो तुम कि तू क्या है।** ",
    " **दिल-ए-नादाँ तुझे हुआ क्या है, आख़िर इस दर्द की दवा क्या है।** ",
    " **हमको उन से वफ़ा की है उम्मीद, जो नहीं जानते वफ़ा क्या है।** ",
    " **दिल-ए-नादाँ तुझे हुआ क्या है।** ",
    " **क़ैद-ए-हयात-ओ-बंद-ए-ग़म दोनों एक हैं।** ",
    " **हज़ारों ख़्वाहिशें ऐसी कि हर ख़्वाहिश पे दम निकले।** ",
    " **इश्क़ ने ‘ग़ालिब’ निकम्मा कर दिया।** ",
 ]

@app.on_message(filters.command(["tagall", "spam", "tagmember", "utag", "stag", "hftag", "bstag", "eftag", "tag", "etag", "utag", "atag"], prefixes=["/", "@", "#"]))
async def mentionall(client, message):
    chat_id = message.chat.id
    if message.chat.type == ChatType.PRIVATE:
        return await message.reply("𝐓𝐡𝐢𝐬 𝐂𝐨𝐦𝐦𝐚𝐧𝐝 𝐎𝐧𝐥𝐲 𝐅𝐨𝐫 𝐆𝐫𝐨𝐮𝐩𝐬.")

    is_admin = False
    try:
        participant = await client.get_chat_member(chat_id, message.from_user.id)
    except UserNotParticipant:
        is_admin = False
    else:
        if participant.status in (
            ChatMemberStatus.ADMINISTRATOR,
            ChatMemberStatus.OWNER
        ):
            is_admin = True
    if not is_admin:
        return await message.reply("𝐘𝐨𝐮 𝐀𝐫𝐞 𝐍𝐨𝐭 𝐀𝐝𝐦𝐢𝐧 𝐁𝐚𝐛𝐲, 𝐎𝐧𝐥𝐲 𝐀𝐝𝐦𝐢𝐧𝐬 𝐂𝐚𝐧 . ")

    if message.reply_to_message and message.text:
        return await message.reply("/tagall  𝐓𝐲𝐩𝐞 𝐋𝐢𝐤𝐞 𝐓𝐡𝐢𝐬 / 𝐑𝐞𝐩𝐥𝐲 𝐀𝐧𝐲 𝐌𝐞𝐬𝐬𝐚𝐠𝐞 𝐍𝐞𝐱𝐭 𝐓𝐢𝐦𝐞 ")
    elif message.text:
        mode = "text_on_cmd"
        msg = message.text
    elif message.reply_to_message:
        mode = "text_on_reply"
        msg = message.reply_to_message
        if not msg:
            return await message.reply("/tagall  𝐓𝐲𝐩𝐞 𝐋𝐢𝐤𝐞 𝐓𝐡𝐢𝐬 / 𝐑𝐞𝐩𝐥𝐲 𝐀𝐧𝐲 𝐌𝐞𝐬𝐬𝐚𝐠𝐞 𝐍𝐞𝐱𝐭 𝐓𝐢𝐦𝐞 ...")
    else:
        return await message.reply("/tagall  𝐓𝐲𝐩𝐞 𝐋𝐢𝐤𝐞 𝐓𝐡𝐢𝐬 / 𝐑𝐞𝐩𝐥𝐲 𝐀𝐧𝐲 𝐌𝐞𝐬𝐬𝐚𝐠𝐞 𝐍𝐞𝐱𝐭 𝐓𝐢𝐦𝐞 ..")
    if chat_id in spam_chats:
        return await message.reply("𝐏𝐥𝐞𝐚𝐬𝐞 𝐀𝐭 𝐅𝐢𝐫𝐬𝐭 𝐒𝐭𝐨𝐩 𝐑𝐮𝐧𝐧𝐢𝐧𝐠 𝐏𝐫𝐨𝐜𝐞𝐬𝐬 ...")
    spam_chats.append(chat_id)
    usrnum = 0
    usrtxt = ""
    async for usr in client.get_chat_members(chat_id):
        if not chat_id in spam_chats:
            break
        if usr.user.is_bot:
            continue
        usrnum += 1
        usrtxt += f"[{usr.user.first_name}](tg://user?id={usr.user.id}) "

        if usrnum == 1:
            if mode == "text_on_cmd":
                txt = f"{usrtxt} {random.choice(TAGMES)}"
                await client.send_message(chat_id, txt)
            elif mode == "text_on_reply":
                await msg.reply(f"[{random.choice(EMOJI)}](tg://user?id={usr.user.id})")
            await asyncio.sleep(4)
            usrnum = 0
            usrtxt = ""
    try:
        spam_chats.remove(chat_id)
    except:
        pass

@app.on_message(filters.command(["tagoff", "tagstop"]))
async def cancel_spam(client, message):
    if not message.chat.id in spam_chats:
        return await message.reply("𝐂𝐮𝐫𝐫𝐞𝐧𝐭𝐥𝐲 𝐈'𝐦 𝐍𝐨𝐭 ..")
    is_admin = False
    try:
        participant = await client.get_chat_member(message.chat.id, message.from_user.id)
    except UserNotParticipant:
        is_admin = False
    else:
        if participant.status in (
            ChatMemberStatus.ADMINISTRATOR,
            ChatMemberStatus.OWNER
        ):
            is_admin = True
    if not is_admin:
        return await message.reply("𝐘𝐨𝐮 𝐀𝐫𝐞 𝐍𝐨𝐭 𝐀𝐝𝐦𝐢𝐧 𝐁𝐚𝐛𝐲, 𝐎𝐧𝐥𝐲 𝐀𝐝𝐦𝐢𝐧𝐬 𝐂𝐚𝐧 𝐓𝐚𝐠 𝐌𝐞𝐦𝐛𝐞𝐫𝐬.")
    else:
        try:
            spam_chats.remove(message.chat.id)
        except:
            pass
        return await message.reply("♦ 𝐈𝐍𝐅𝐈𝐍𝐈𝐓𝐘 sᴛᴏᴘᴘᴇᴅ ᴛᴀɢɪɴɢ...♦")
